#+title: All JACoW Events
#+PROPERTY: header-args:python :noweb no-export :mkdirp yes :eval no

** Compile

#+begin_src emacs-lisp :eval yes
  (org-entry-get (point) "header-args:python" 'inherit)
#+end_src

#+RESULTS:
: :noweb no-export :mkdirp yes :eval no

The codes will be put in =./code= directory. Run the following command to compile everything to python:
#+begin_src shell :results raw :wrap example
  coconut --package code/
#+end_src

#+RESULTS:
#+begin_example
Left unchanged    code/event_list.py (pass --force to overwrite).
Left unchanged    code/__constants__.py (pass --force to overwrite).
Compiling         code/csv_to_bib.coco ...
Left unchanged    code/__init__.py (pass --force to overwrite).
Compiled to       code/csv_to_bib.py .
#+end_example

#+begin_src shell :results raw :wrap example :dir code
  ls -lha
#+end_src

#+RESULTS:
#+begin_example
total 188K
drwxr-xr-x 12 zhichu staff  384 Nov 26 19:21 .
drwxr-xr-x 19 zhichu staff  608 Nov 26 19:22 ..
-rw-r--r--  1 zhichu staff 144K Nov 26 19:06 __coconut__.py
drwxr-xr-x  5 zhichu staff  160 Nov 26 17:05 __coconut_cache__
-rw-r--r--  1 zhichu staff    1 Nov 26 19:21 __init__.coco
-rw-r--r--  1 zhichu staff 4.8K Nov 23 12:32 __init__.py
drwxr-xr-x  6 zhichu staff  192 Nov 26 19:07 __pycache__
-rw-r--r--  1 zhichu staff 2.0K Nov 26 19:21 csv_to_bib.coco
-rw-r--r--  1 zhichu staff 9.6K Nov 26 15:46 csv_to_bib.py
-rw-r--r--  1 zhichu staff  572 Nov 26 19:21 get_list.coco
-rw-r--r--  1 zhichu staff 6.0K Nov 26 19:06 get_list.py
-rwxr-xr-x  1 zhichu staff   81 Nov 26 19:21 update_list
#+end_example

*** Handy scripts

Create a handy script to update the bibtex database:
#+begin_src python :tangle code/update_bib :shebang "#!/usr/bin/env python" :dir code
  from csv_to_bib import generate_bib
  generate_bib()
#+end_src
Either run the above code block or run the following shell script
#+begin_src shell :dir code :results raw replace output :wrap example
  ./update_bib
#+end_src

#+RESULTS:
#+begin_example
#+end_example


** Test
:PROPERTIES:
:header-args:python: :eval yes :results output raw :wrap example :dir code
:END:

#+begin_src emacs-lisp
  (org-entry-get (point) "header-args:python" 'inherit)
#+end_src

#+RESULTS:
: :eval yes :results output raw :wrap example :dir code

#+begin_src shell :dir code :results raw replace output :wrap example
  ./update_list
#+end_src

#+RESULTS:
#+begin_example
CYCLOTRONS1959  CYCLOTRONS1963  CYCLOTRONS1966  CYCLOTRONS1969  CYCLOTRONS1972  CYCLOTRONS1975  CYCLOTRONS1978  CYCLOTRONS1981  CYCLOTRONS1984  CYCLOTRONS1986  LINAC1961       LINAC1962       LINAC1963       LINAC1964       LINAC1966       LINAC1968       LINAC1970       LINAC1972       LINAC1976       LINAC1979       LINAC1981       LINAC1984       LINAC1986       PAC1965         PAC1967         PAC1969         PAC1971         PAC1973         PAC1975         PAC1977         PAC1979         PAC1981         PAC1983         PAC1985         SRF1980         SRF1984         
#+end_example

#+begin_src shell :dir code :results raw replace output :wrap example
  ./update_bib
#+end_src

#+RESULTS:
#+begin_example
SRF1984.bib generated
#+end_example


** Events table

| Series     | Event Date                   | Venue                                      | Year | Link          | TODO |
|------------+------------------------------+--------------------------------------------+------+---------------+------|
| CYCLOTRONS | <1959-02-02>--<1959-02-04> | Sea Island, Georgia, USA                   | 1959 | [[file:CYCLOTRONS1959.org][CYCLOTRONS’59]] |      |
| LINAC      | <1961-04-01>--<1961-04-14> | Upton, Long Island, New York, USA          | 1961 | [[file:LINAC1961.org][LINAC’61]]      |      |
| LINAC      | <1962-08-20>--<1962-08-24> | Upton, Long Island, New York, USA          | 1962 | [[file:LINAC1962.org][LINAC’62]]      |      |
| CYCLOTRONS | <1963-04-23>--<1963-04-26> | Geneva, Switzerland                        | 1963 | [[file:CYCLOTRONS1963.org][CYCLOTRONS’63]] |      |
| LINAC      | <1963-10-21>--<1963-10-25> | New Haven, Connecticut, USA                | 1963 | [[file:LINAC1963.org][LINAC’63]]      |      |
| LINAC      | <1964-07-20>--<1964-07-24> | Madison, Wisconsin, USA                    | 1964 | [[file:LINAC1964.org][LINAC’64]]      |      |
| PAC        | <1965-03-10>--<1965-03-12> | Washington D.C., USA                       | 1965 | [[file:PAC1965.org][PAC’65]]        |      |
| CYCLOTRONS | <1966-05-02>--<1966-05-05> | Gatlinburg, Tennessee, USA                 | 1966 | [[file:CYCLOTRONS1966.org][CYCLOTRONS’66]] |      |
| LINAC      | <1966-10-03>--<1966-10-07> | Los Alamos, New Mexico, USA                | 1966 | [[file:LINAC1966.org][LINAC’66]]      |      |
| PAC        | <1967-03-01>--<1967-03-03> | Washington D.C., USA                       | 1967 | [[file:PAC1967.org][PAC’67]]        |      |
| LINAC      | <1968-05-20>--<1968-05-24> | Upton, Long Island, New York, USA          | 1968 | [[file:LINAC1968.org][LINAC’68]]      |      |
| PAC        | <1969-03-05>--<1969-03-07> | Washington D.C., USA                       | 1969 | [[file:PAC1969.org][PAC’69]]        |      |
| CYCLOTRONS | <1969-09-17>--<1969-09-20> | Oxford, United Kingdom                     | 1969 | [[file:CYCLOTRONS1969.org][CYCLOTRONS’69]] |      |
| LINAC      | <1970-09-28>--<1970-10-02> | Batavia, Illinois, USA                     | 1970 | [[file:LINAC1970.org][LINAC’70]]      |      |
| PAC        | <1971-03-01>--<1971-03-03> | Chicago, IL, USA                           | 1971 | [[file:PAC1971.org][PAC’71]]        |      |
| CYCLOTRONS | <1972-07-18>--<1972-07-21> | Vancouver, Canada                          | 1972 | [[file:CYCLOTRONS1972.org][CYCLOTRONS’72]] |      |
| LINAC      | <1972-10-10>--<1972-10-13> | Los Alamos, New Mexico, USA                | 1972 | [[file:LINAC1972.org][LINAC’72]]      |      |
| PAC        | <1973-03-05>--<1973-03-07> | San Francisco, CA, USA                     | 1973 | [[file:PAC1973.org][PAC’73]]        |      |
| PAC        | <1975-03-12>--<1975-03-14> | Washington D.C., USA                       | 1975 | [[file:PAC1975.org][PAC’75]]        |      |
| CYCLOTRONS | <1975-08-19>--<1975-08-22> | Zürich, Switzerland                        | 1975 | [[file:CYCLOTRONS1975.org][CYCLOTRONS’75]] |      |
| LINAC      | <1976-09-14>--<1976-09-17> | Chalk River, Ontario, Canada               | 1976 | [[file:LINAC1976.org][LINAC’76]]      |      |
| PAC        | <1977-03-16>--<1977-03-18> | Chicago, IL, USA                           | 1977 | [[file:PAC1977.org][PAC’77]]        |      |
| CYCLOTRONS | <1978-09-18>--<1978-09-21> | Bloomington, Indiana, USA                  | 1978 | [[file:CYCLOTRONS1978.org][CYCLOTRONS’78]] |      |
| PAC        | <1979-03-12>--<1979-03-14> | San Francisco, CA, USA                     | 1979 | [[file:PAC1979.org][PAC’79]]        |      |
| LINAC      | <1979-09-10>--<1979-09-14> | Montauk, New York, USA                     | 1979 | [[file:LINAC1979.org][LINAC’79]]      |      |
| SRF        | <1980-07-02>--<1980-07-04> | Karlsruhe, Germany                         | 1980 | [[file:SRF1980.org][SRF’80]]        |      |
| PAC        | <1981-03-11>--<1981-03-13> | Washington D.C., USA                       | 1981 | [[file:PAC1981.org][PAC’81]]        |      |
| CYCLOTRONS | <1981-09-07>--<1981-09-10> | Caen, France                               | 1981 | [[file:CYCLOTRONS1981.org][CYCLOTRONS’81]] |      |
| LINAC      | <1981-10-19>--<1981-10-23> | Santa Fe, New Mexico, USA                  | 1981 | [[file:LINAC1981.org][LINAC’81]]      |      |
| PAC        | <1983-03-21>--<1983-03-23> | Santa Fe, New Mexico, USA                  | 1983 | [[file:PAC1983.org][PAC’83]]        |      |
| CYCLOTRONS | <1984-04-30>--<1984-05-03> | East Lansing, Michigan, USA                | 1984 | [[file:CYCLOTRONS1984.org][CYCLOTRONS’84]] |      |
| LINAC      | <1984-05-07>--<1984-05-11> | Seeheim, Germany                           | 1984 | [[file:LINAC1984.org][LINAC’84]]      |      |
| SRF        | <1984-07-23>--<1984-07-27> | Geneva, Switzerland                        | 1984 | [[file:SRF1984.org][SRF’84]]        |      |
| PAC        | <1985-03-13>--<1985-03-16> | Vancouver, BC, Canada                      | 1985 | [[file:PAC1985.org][PAC’85]]        |      |
| LINAC      | <1986-06-02>--<1986-06-06> | Stanford, California, USA                  | 1986 | [[file:LINAC1986.org][LINAC’86]]      |      |
| CYCLOTRONS | <1986-10-13>--<1986-10-17> | Tokyo, Japan                               | 1986 | [[file:CYCLOTRONS1986.org][CYCLOTRONS’86]] | *?*    |
| PAC        | <1987-03-16>--<1987-03-19> | Washington D.C., USA                       | 1987 | [[file:PAC1987.org][PAC’87]]        | *?*    |
| SRF        | <1987-09-14>--<1987-09-18> | Argonne National Laboratory, Illinois, USA | 1987 | [[file:SRF1987.org][SRF’87]]        | *?*    |
| EPAC       | <1988-06-07>--<1988-06-11> | Rome, Italy                                | 1988 | [[file:EPAC1988.org][EPAC’88]]       | *?*    |
| LINAC      | <1988-10-03>--<1988-10-07> | Newport News, Virginia, USA                | 1988 | [[file:LINAC1988.org][LINAC’88]]      | *?*    |
| PAC        | <1989-03-20>--<1989-03-23> | Chicago, IL, USA                           | 1989 | [[file:PAC1989.org][PAC’89]]        | *?*    |
| CYCLOTRONS | <1989-05-08>--<1989-05-12> | Berlin, Germany                            | 1989 | [[file:CYCLOTRONS1989.org][CYCLOTRONS’89]] | *?*    |
| SRF        | <1989-08-14>--<1989-08-18> | KEK, Tsukuba, Japan                        | 1989 | [[file:SRF1989.org][SRF’89]]        | *?*    |
| EPAC       | <1990-06-12>--<1990-06-16> | Nice, France                               | 1990 | [[file:EPAC1990.org][EPAC’90]]       | *?*    |
| LINAC      | <1990-09-10>--<1990-09-14> | Albuquerque, New Mexico, USA               | 1990 | [[file:LINAC1990.org][LINAC’90]]      | *?*    |
| PAC        | <1991-05-06>--<1991-05-09> | San Francisco, CA, USA                     | 1991 | [[file:PAC1991.org][PAC’91]]        | *?*    |
| SRF        | <1991-08-19>--<1991-08-23> | DESY, Hamburg, Germany                     | 1991 | [[file:SRF1991.org][SRF’91]]        | *?*    |
| ICALEPCS   | <1991-11-11>--<1991-11-15> | Tsukuba, Japan                             | 1991 | [[file:ICALEPCS1991.org][ICALEPCS’91]]   | *?*    |
| EPAC       | <1992-03-24>--<1992-03-28> | Berlin, Germany                            | 1992 | [[file:EPAC1992.org][EPAC’92]]       | *?*    |
| CYCLOTRONS | <1992-07-06>--<1992-07-10> | Vancouver, BC, Canada                      | 1992 | [[file:CYCLOTRONS1992.org][CYCLOTRONS’92]] | *?*    |
| LINAC      | <1992-08-24>--<1992-08-28> | Ottawa, Ontario, Canada                    | 1992 | [[file:LINAC1992.org][LINAC’92]]      | *?*    |
| PAC        | <1993-05-17>--<1993-05-20> | Washington D.C., USA                       | 1993 | [[file:PAC1993.org][PAC’93]]        | *?*    |
| SRF        | <1993-10-04>--<1993-10-08> | CEBAF, Newport News, Virginia, USA         | 1993 | [[file:SRF1993.org][SRF’93]]        | *?*    |
| EPAC       | <1994-06-27>--<1994-07-01> | London, England                            | 1994 | [[file:EPAC1994.org][EPAC’94]]       | *?*    |
| LINAC      | <1994-08-21>--<1994-08-26> | Tsukuba, Japan                             | 1994 | [[file:LINAC1994.org][LINAC’94]]      | *?*    |
| PAC        | <1995-05-01>--<1995-05-05> | Dallas, Texas, USA                         | 1995 | [[file:PAC1995.org][PAC’95]]        | *?*    |
| CYCLOTRONS | <1995-10-08>--<1995-10-13> | Cape Town, South Africa                    | 1995 | [[file:CYCLOTRONS1995.org][CYCLOTRONS’95]] | *?*    |
| SRF        | <1995-10-17>--<1995-10-20> | Gif-sur-Yvette, France                     | 1995 | [[file:SRF1995.org][SRF’95]]        | *?*    |
| EPAC       | <1996-06-10>--<1996-06-14> | Sitges, Spain                              | 1996 | [[file:EPAC1996.org][EPAC’96]]       | *?*    |
| LINAC      | <1996-08-26>--<1996-08-30> | Geneva, Switzerland                        | 1996 | [[file:LINAC1996.org][LINAC’96]]      | *?*    |
| PAC        | <1997-05-12>--<1997-05-16> | Vancouver, B.C., Canada                    | 1997 | [[file:PAC1997.org][PAC’97]]        | *?*    |
| SRF        | <1997-10-06>--<1997-10-10> | Abano Terme (Padova), Italy                | 1997 | [[file:SRF1997.org][SRF’97]]        | *?*    |
| APAC       | <1998-03-23>--<1998-03-27> | Tsukuba, Japan                             | 1998 | [[file:APAC1998.org][APAC’98]]       | *?*    |
| CYCLOTRONS | <1998-06-14>--<1998-06-19> | Caen, Franc                                | 1998 | [[file:CYCLOTRONS1998.org][CYCLOTRONS’98]] | *?*    |
| EPAC       | <1998-06-22>--<1998-06-26> | Stockholm, Sweden                          | 1998 | [[file:EPAC1998.org][EPAC’98]]       | *?*    |
| LINAC      | <1998-08-23>--<1998-08-28> | Chicago, Illinois, USA                     | 1998 | [[file:LINAC1998.org][LINAC’98]]      | *?*    |
| PAC        | <1999-03-29>--<1999-04-02> | New York City, New York, USA               | 1999 | [[file:PAC1999.org][PAC’99]]        | *?*    |
| DIPAC      | <1999-05-16>--<1999-05-18> | Chester, UK                                | 1999 | [[file:DIPAC1999.org][DIPAC’99]]      | *?*    |
| ICALEPCS   | <1999-10-04>--<1999-10-08> | Trieste, Italy                             | 1999 | [[file:ICALEPCS1999.org][ICALEPCS’99]]   | *?*    |
| SRF        | <1999-11-01>--<1999-11-05> | Santa Fe, New Mexico, USA                  | 1999 | [[file:SRF1999.org][SRF’99]]        | *?*    |
| EPAC       | <2000-06-26>--<2000-06-30> | Vienna, Austria                            | 2000 | [[file:EPAC2000.org][EPAC’00]]       | *?*    |
| LINAC      | <2000-08-21>--<2000-08-25> | Monterey, CA, USA                          | 2000 | [[file:LINAC2000.org][LINAC’00]]      | *?*    |
| CYCLOTRONS | <2001-05-13>--<2001-05-17> | East Lansing, Michigan, USA                | 2001 | [[file:CYCLOTRONS2001.org][CYCLOTRONS’01]] | *?*    |
| DIPAC      | <2001-05-13>--<2001-05-15> | Grenoble, France                           | 2001 | [[file:DIPAC2001.org][DIPAC’01]]      | *?*    |
| PAC        | <2001-06-18>--<2001-06-22> | Chicago, Illinois, USA                     | 2001 | [[file:PAC2001.org][PAC’01]]        | *?*    |
| SRF        | <2001-09-06>--<2001-09-11> | Tsukuba, Ibaraki, Japan                    | 2001 | [[file:SRF2001.org][SRF’01]]        | *?*    |
| APAC       | <2001-09-17>--<2001-09-21> | Beijing, China                             | 2001 | [[file:APAC2001.org][APAC’01]]       | *?*    |
| ICALEPCS   | <2001-11-27>--<2001-11-30> | San Jose, California, USA                  | 2001 | [[file:ICALEPCS2001.org][ICALEPCS’01]]   | *?*    |
| EPAC       | <2002-06-03>--<2002-06-07> | Paris, France                              | 2002 | [[file:EPAC2002.org][EPAC’02]]       | *?*    |
| LINAC      | <2002-08-19>--<2002-08-23> | Gyeongju, Korea                            | 2002 | [[file:LINAC2002.org][LINAC’02]]      | *?*    |
| DIPAC      | <2003-05-05>--<2003-05-07> | Mainz,  Germany                            | 2003 | [[file:DIPAC2003.org][DIPAC’03]]      | *?*    |
| PAC        | <2003-05-12>--<2003-05-16> | Portland, Oregon, USA                      | 2003 | [[file:PAC2003.org][PAC’03]]        | *?*    |
| SRF        | <2003-09-08>--<2003-09-12> | Lübeck/Travemünder, Germany                | 2003 | [[file:SRF2003.org][SRF’03]]        | *?*    |
| ICALEPCS   | <2003-10-13>--<2003-10-17> | Gyeongju, Korea                            | 2003 | [[file:ICALEPCS2003.org][ICALEPCS’03]]   | *?*    |
| APAC       | <2004-03-22>--<2004-03-26> | Gyeongju, Korea                            | 2004 | [[file:APAC2004.org][APAC’04]]       | *?*    |
| EPAC       | <2004-07-05>--<2004-07-09> | Lucerne, Switzerland                       | 2004 | [[file:EPAC2004.org][EPAC’04]]       | *?*    |
| LINAC      | <2004-08-16>--<2004-08-20> | Lübeck, Germany                            | 2004 | [[file:LINAC2004.org][LINAC’04]]      | *?*    |
| FEL        | <2004-08-29>--<2004-09-03> | Trieste, Italy                             | 2004 | [[file:FEL2004.org][FEL’04]]        | *?*    |
| RuPAC      | <2004-10-04>--<2004-10-08> | Dubna, Russia                              | 2004 | [[file:RuPAC2004.org][RuPAC’04]]      | *?*    |
| CYCLOTRONS | <2004-10-18>--<2004-10-22> | Tokyo, Japan                               | 2004 | [[file:CYCLOTRONS2004.org][CYCLOTRONS’04]] | *?*    |
| PAC        | <2005-05-16>--<2005-05-20> | Knoxville, Tennessee, USA                  | 2005 | [[file:PAC2005.org][PAC’05]]        | *?*    |
| DIPAC      | <2005-06-06>--<2005-06-08> | Lyon, France                               | 2005 | [[file:DIPAC2005.org][DIPAC’05]]      | *?*    |
| SRF        | <2005-07-10>--<2005-07-15> | Cornell University, Ithaca, New York, USA  | 2005 | [[file:SRF2005.org][SRF’05]]        | *?*    |
| FEL        | <2005-08-21>--<2005-08-26> | Palo Alto, California, USA                 | 2005 | [[file:FEL2005.org][FEL’05]]        | *?*    |
| ICALEPCS   | <2005-10-10>--<2005-10-14> | Geneva, Switzerland                        | 2005 | [[file:ICALEPCS2005.org][ICALEPCS’05]]   | *?*    |
| FLS        | <2006-05-15>--<2006-05-16> | Hamburg, Germany                           | 2006 | [[file:FLS2006.org][FLS’06]]        | *?*    |
| HB         | <2006-05-29>--<2006-06-02> | Tsukuba, Japan                             | 2006 | [[file:HB2006.org][HB’06]]         | *?*    |
| EPAC       | <2006-06-26>--<2006-06-30> | Edinburgh, UK                              | 2006 | [[file:EPAC2006.org][EPAC’06]]       | *?*    |
| LINAC      | <2006-08-21>--<2006-08-25> | Knoxville, Tennessee USA                   | 2006 | [[file:LINAC2006.org][LINAC’06]]      | *?*    |
| FEL        | <2006-08-27>--<2006-09-01> | Berlin, Germany                            | 2006 | [[file:FEL2006.org][FEL’06]]        | *?*    |
| RuPAC      | <2006-09-10>--<2006-09-14> | Novosibirsk, Russia                        | 2006 | [[file:RuPAC2006.org][RuPAC’06]]      | *?*    |
| ICAP       | <2006-10-02>--<2006-10-06> | Chamonix, France                           | 2006 | [[file:ICAP2006.org][ICAP’06]]       | *?*    |
| APAC       | <2007-01-29>--<2007-02-02> | Indore, India                              | 2007 | [[file:APAC2007.org][APAC’07]]       | *?*    |
| DIPAC      | <2007-05-20>--<2007-05-23> | Venice, Italy                              | 2007 | [[file:DIPAC2007.org][DIPAC’07]]      | *?*    |
| ERL        | <2007-05-21>--<2007-05-25> | Daresbury, United Kingdom                  | 2007 | [[file:ERL2007.org][ERL’07]]        | *?*    |
| PAC        | <2007-06-25>--<2007-06-29> | Albuquerque, New Mexico, USA               | 2007 | [[file:PAC2007.org][PAC’07]]        | *?*    |
| FEL        | <2007-08-26>--<2007-08-31> | Novosibirsk, Russia                        | 2007 | [[file:FEL2007.org][FEL’07]]        | *?*    |
| COOL       | <2007-09-09>--<2007-09-14> | Bad Kreuznach, Germany                     | 2007 | [[file:COOL2007.org][COOL’07]]       | *?*    |
| CYCLOTRONS | <2007-10-01>--<2007-10-05> | Giardini Naxos, Italy                      | 2007 | [[file:CYCLOTRONS2007.org][CYCLOTRONS’07]] | *?*    |
| SRF        | <2007-10-14>--<2007-10-19> | Peking Univ., Beijing, China               | 2007 | [[file:SRF2007.org][SRF’07]]        | *?*    |
| ICALEPCS   | <2007-10-15>--<2007-10-19> | Knoxville, Tennessee, USA                  | 2007 | [[file:ICALEPCS2007.org][ICALEPCS’07]]   | *?*    |
| eeFACT     | <2008-04-14>--<2008-04-16> | Novosibirsk, Russia                        | 2008 | [[file:eeFACT2008.org][eeFACT’08]]     | *?*    |
| BIW        | <2008-05-04>--<2008-05-08> | Tahoe City, California, USA                | 2008 | [[file:BIW2008.org][BIW’08]]        | *?*    |
| EPAC       | <2008-06-23>--<2008-06-27> | Genoa, Italy                               | 2008 | [[file:EPAC2008.org][EPAC’08]]       | *?*    |
| FEL        | <2008-08-24>--<2008-08-29> | Gyeongju, Korea                            | 2008 | [[file:FEL2008.org][FEL’08]]        | *?*    |
| HB         | <2008-08-25>--<2008-08-29> | Nashville, Tennessee, USA                  | 2008 | [[file:HB2008.org][HB’08]]         | *?*    |
| ECRIS      | <2008-09-15>--<2008-09-18> | Chicago, Illinois, USA                     | 2008 | [[file:ECRIS2008.org][ECRIS’08]]      | *?*    |
| RuPAC      | <2008-09-28>--<2008-10-03> | Zvenigorod, Russia                         | 2008 | [[file:RuPAC2008.org][RuPAC’08]]      | *?*    |
| LINAC      | <2008-09-29>--<2008-10-03> | Victoria, British Columbia, Canada         | 2008 | [[file:LINAC2008.org][LINAC’08]]      | *?*    |
| PCaPAC     | <2008-10-20>--<2008-10-23> | Ljubljana, Slovenia                        | 2008 | [[file:PCaPAC2008.org][PCaPAC’08]]     | *?*    |
| PAC        | <2009-05-04>--<2009-05-08> | Vancouver, British Columbia, Canada        | 2009 | [[file:PAC2009.org][PAC’09]]        | *?*    |
| DIPAC      | <2009-05-25>--<2009-05-27> | Basel, Switzerland                         | 2009 | [[file:DIPAC2009.org][DIPAC’09]]      | *?*    |
| ERL        | <2009-06-08>--<2009-06-12> | Ithaca, New York, USA                      | 2009 | [[file:ERL2009.org][ERL’09]]        | *?*    |
| HIAT       | <2009-06-08>--<2009-06-12> | Venice, Italy                              | 2009 | [[file:HIAT2009.org][HIAT’09]]       | *?*    |
| FEL        | <2009-08-23>--<2009-08-28> | Liverpool, UK                              | 2009 | [[file:FEL2009.org][FEL’09]]        | *?*    |
| COOL       | <2009-08-31>--<2009-09-04> | Lanzhou, China                             | 2009 | [[file:COOL2009.org][COOL’09]]       | *?*    |
| ICAP       | <2009-08-31>--<2009-09-04> | San Francisco, California, US              | 2009 | [[file:ICAP2009.org][ICAP’09]]       | *?*    |
| SRF        | <2009-09-20>--<2009-09-25> | Berlin, Germany                            | 2009 | [[file:SRF2009.org][SRF’09]]        | *?*    |
| ICALEPCS   | <2009-10-12>--<2009-10-16> | Kobe, Japan                                | 2009 | [[file:ICALEPCS2009.org][ICALEPCS’09]]   | *?*    |
| BIW        | <2010-05-02>--<2010-05-06> | Santa Fe, New Mexico, USA                  | 2010 | [[file:BIW2010.org][BIW’10]]        | *?*    |
| IPAC       | <2010-05-23>--<2010-05-28> | Kyoto, Japan                               | 2010 | [[file:IPAC2010.org][IPAC’10]]       | *?*    |
| ECRIS      | <2010-08-23>--<2010-08-26> | Grenoble, France                           | 2010 | [[file:ECRIS2010.org][ECRIS’10]]      | *?*    |
| FEL        | <2010-08-23>--<2010-08-27> | Malmö, Sweden                              | 2010 | [[file:FEL2010.org][FEL’10]]        | *?*    |
| CYCLOTRONS | <2010-09-06>--<2010-09-10> | Lanzhou, China                             | 2010 | [[file:CYCLOTRONS2010.org][CYCLOTRONS’10]] | *?*    |
| LINAC      | <2010-09-12>--<2010-09-17> | Tsukuba, Japan                             | 2010 | [[file:LINAC2010.org][LINAC’10]]      | *?*    |
| HB         | <2010-09-27>--<2010-10-01> | Morschach, Switzerland                     | 2010 | [[file:HB2010.org][HB’10]]         | *?*    |
| RuPAC      | <2010-09-27>--<2010-10-01> | Protvino, Russia                           | 2010 | [[file:RuPAC2010.org][RuPAC’10]]      | *?*    |
| PCaPAC     | <2010-10-06>--<2010-10-08> | Saskatoon, Saskatchewan, Canada            | 2010 | [[file:PCaPAC2010.org][PCaPAC’10]]     | *?*    |
| eCloud     | <2010-10-08>--<2010-10-12> | Ithaca, New York, USA                      | 2010 | [[file:eCloud2010.org][eCloud’10]]     | *?*    |
| NAPAC      | <2011-03-28>--<2011-04-01> | New York, NY, USA                          | 2011 | [[file:NAPAC2011.org][NAPAC’11]]      | *?*    |
| DIPAC      | <2011-05-16>--<2011-05-18> | Hamburg, Germany                           | 2011 | [[file:DIPAC2011.org][DIPAC’11]]      | *?*    |
| SRF        | <2011-07-25>--<2011-07-29> | Chicago, IL, USA                           | 2011 | [[file:SRF2011.org][SRF’11]]        | *?*    |
| FEL        | <2011-08-22>--<2011-08-26> | Shanghai, China                            | 2011 | [[file:FEL2011.org][FEL’11]]        | *?*    |
| IPAC       | <2011-09-04>--<2011-09-09> | San Sebastián, Spain                       | 2011 | [[file:IPAC2011.org][IPAC’11]]       | *?*    |
| COOL       | <2011-09-12>--<2011-09-16> | Alushta, Ukraine                           | 2011 | [[file:COOL2011.org][COOL’11]]       | *?*    |
| ICALEPCS   | <2011-10-10>--<2011-10-14> | Grenoble, France                           | 2011 | [[file:ICALEPCS2011.org][ICALEPCS’11]]   | *?*    |
| ERL        | <2011-10-16>--<2011-10-21> | Tsukuba, Japan                             | 2011 | [[file:ERL2011.org][ERL’11]]        | *?*    |
| BIW        | <2012-04-15>--<2012-04-19> | Newport News, Virginia, USA                | 2012 | [[file:BIW2012.org][BIW’12]]        | *?*    |
| IPAC       | <2012-05-20>--<2012-05-25> | New Orleans, Louisiana, USA                | 2012 | [[file:IPAC2012.org][IPAC’12]]       | *?*    |
| HIAT       | <2012-06-18>--<2012-06-21> | Chicago, IL, USA                           | 2012 | [[file:HIAT2012.org][HIAT’12]]       | *?*    |
| ICAP       | <2012-08-19>--<2012-08-24> | Rostock-Warnemünde, Germany                | 2012 | [[file:ICAP2012.org][ICAP’12]]       | *?*    |
| FEL        | <2012-08-26>--<2012-08-31> | Nara, Japan                                | 2012 | [[file:FEL2012.org][FEL’12]]        | *?*    |
| LINAC      | <2012-09-09>--<2012-09-14> | Tel Aviv, Israel                           | 2012 | [[file:LINAC2012.org][LINAC’12]]      | *?*    |
| HB         | <2012-09-17>--<2012-09-21> | Beijing, China                             | 2012 | [[file:HB2012.org][HB’12]]         | *?*    |
| RuPAC      | <2012-09-24>--<2012-09-28> | Saint-Petersburg, Russia                   | 2012 | [[file:RuPAC2012.org][RuPAC’12]]      | *?*    |
| ECRIS      | <2012-09-25>--<2012-09-28> | Sydney, Australia                          | 2012 | [[file:ECRIS2012.org][ECRIS’12]]      | *?*    |
| IBIC       | <2012-10-01>--<2012-10-04> | Tsukuba, Japan                             | 2012 | [[file:IBIC2012.org][IBIC’12]]       | *?*    |
| PCaPAC     | <2012-12-04>--<2012-12-07> | Kolkata, India                             | 2012 | [[file:PCaPAC2012.org][PCaPAC’12]]     | *?*    |
| IPAC       | <2013-05-12>--<2013-05-17> | Shanghai, China                            | 2013 | [[file:IPAC2013.org][IPAC’13]]       | *?*    |
| COOL       | <2013-06-10>--<2013-06-14> | Mürren, Switzerland                        | 2013 | [[file:COOL2013.org][COOL’13]]       | *?*    |
| FEL        | <2013-08-26>--<2013-08-30> | Manhattan, NY, USA                         | 2013 | [[file:FEL2013.org][FEL’13]]        | *?*    |
| ERL        | <2013-09-09>--<2013-09-13> | Novosibirsk, Russia                        | 2013 | [[file:ERL2013.org][ERL’13]]        | *?*    |
| CYCLOTRONS | <2013-09-16>--<2013-09-20> | Vancouver, BC, Canada                      | 2013 | [[file:CYCLOTRONS2013.org][CYCLOTRONS’13]] | *?*    |
| IBIC       | <2013-09-16>--<2013-09-19> | Oxford, UK                                 | 2013 | [[file:IBIC2013.org][IBIC’13]]       | *?*    |
| SRF        | <2013-09-23>--<2013-09-27> | Paris, France                              | 2013 | [[file:SRF2013.org][SRF’13]]        | *?*    |
| NAPAC      | <2013-09-29>--<2013-10-04> | Pasadena, CA, USA                          | 2013 | [[file:NAPAC2013.org][NAPAC’13]]      | *?*    |
| ICALEPCS   | <2013-10-06>--<2013-10-11> | San Francisco, CA, USA                     | 2013 | [[file:ICALEPCS2013.org][ICALEPCS’13]]   | *?*    |
| IPAC       | <2014-06-15>--<2014-06-20> | Dresden, Germany                           | 2014 | [[file:IPAC2014.org][IPAC’14]]       | *?*    |
| SAP        | <2014-08-13>--<2014-08-15> | Lanzhou, China                             | 2014 | [[file:SAP2014.org][SAP’14]]        | *?*    |
| ECRIS      | <2014-08-24>--<2014-08-28> | Nizhny Novgorod, Russia                    | 2014 | [[file:ECRIS2014.org][ECRIS’14]]      | *?*    |
| FEL        | <2014-08-25>--<2014-08-29> | Basel, Switzerland                         | 2014 | [[file:FEL2014.org][FEL’14]]        | *?*    |
| LINAC      | <2014-08-31>--<2014-09-05> | Geneva, Switzerland                        | 2014 | [[file:LINAC2014.org][LINAC’14]]      | *?*    |
| IBIC       | <2014-09-14>--<2014-09-18> | Monterey, CA, USA                          | 2014 | [[file:IBIC2014.org][IBIC’14]]       | *?*    |
| RuPAC      | <2014-10-06>--<2014-10-10> | Obninsk, Russia                            | 2014 | [[file:RuPAC2014.org][RuPAC’14]]      | *?*    |
| HF         | <2014-10-09>--<2014-10-12> | Beijing, China                             | 2014 | [[file:HF2014.org][HF’14]]         | *?*    |
| PCaPAC     | <2014-10-14>--<2014-10-17> | Karlsruhe, Germany                         | 2014 | [[file:PCaPAC2014.org][PCaPAC’14]]     | *?*    |
| HB         | <2014-11-10>--<2014-11-14> | East-Lansing, MI, USA                      | 2014 | [[file:HB2014.org][HB’14]]         | *?*    |
| IPAC       | <2015-05-03>--<2015-05-08> | Richmond, VA, USA                          | 2015 | [[file:IPAC2015.org][IPAC’15]]       | *?*    |
| ERL        | <2015-06-07>--<2015-06-12> | Stony Brook, NY, USA                       | 2015 | [[file:ERL2015.org][ERL’15]]        | *?*    |
| FEL        | <2015-08-23>--<2015-08-28> | Daejeon, Korea                             | 2015 | [[file:FEL2015.org][FEL’15]]        | *?*    |
| HIAT       | <2015-09-07>--<2015-09-11> | Yokohama, Japan                            | 2015 | [[file:HIAT2015.org][HIAT’15]]       | *?*    |
| IBIC       | <2015-09-13>--<2015-09-17> | Melbourne, Australia                       | 2015 | [[file:IBIC2015.org][IBIC’15]]       | *?*    |
| SRF        | <2015-09-13>--<2015-09-18> | Whistler, BC, Canada                       | 2015 | [[file:SRF2015.org][SRF’15]]        | *?*    |
| COOL       | <2015-09-28>--<2015-10-02> | Newport News, Virginia, USA                | 2015 | [[file:COOL2015.org][COOL’15]]       | *?*    |
| ICAP       | <2015-10-12>--<2015-10-16> | Shanghai, China                            | 2015 | [[file:ICAP2015.org][ICAP’15]]       | *?*    |
| ICALEPCS   | <2015-10-17>--<2015-10-23> | Melbourne, Australia                       | 2015 | [[file:ICALEPCS2015.org][ICALEPCS’15]]   | *?*    |
| HB         | <2016-07-03>--<2016-07-08> | Malmö, Sweden                              | 2016 | [[file:HB2016.org][HB’16]]         | *?*    |
| IPAC       | <2016-08-08>--<2016-05-13> | Busan, Korea                               | 2016 | [[file:IPAC2016.org][IPAC’16]]       | *?*    |
| ECRIS      | <2016-08-28>--<2016-09-01> | Busan, Korea                               | 2016 | [[file:ECRIS2016.org][ECRIS’16]]      | *?*    |
| CYCLOTRONS | <2016-09-11>--<2016-09-16> | Zürich, Switzerland                        | 2016 | [[file:CYCLOTRONS2016.org][CYCLOTRONS’16]] | *?*    |
| IBIC       | <2016-09-11>--<2016-09-15> | Barcelona, Spain                           | 2016 | [[file:IBIC2016.org][IBIC’16]]       | *?*    |
| MEDSI      | <2016-09-11>--<2016-09-16> | Barcelona, Spain                           | 2016 | [[file:MEDSI2016.org][MEDSI’16]]      | *?*    |
| LINAC      | <2016-09-25>--<2016-09-30> | East Lansing, MI, USA                      | 2016 | [[file:LINAC2016.org][LINAC’16]]      | *?*    |
| NAPAC      | <2016-10-09>--<2016-10-14> | Chicago, IL, USA                           | 2016 | [[file:NAPAC2016.org][NAPAC’16]]      | *?*    |
| eeFACT     | <2016-10-24>--<2016-10-27> | Daresbury, United Kingdom                  | 2016 | [[file:eeFACT2016.org][eeFACT’16]]     | *?*    |
| PCaPAC     | <2016-10-25>--<2016-10-28> | Campinas, Brazil                           | 2016 | [[file:PCaPAC2016.org][PCaPAC’16]]     | *?*    |
| RuPAC      | <2016-11-21>--<2016-11-25> | Saint-Petersburg, Russia                   | 2016 | [[file:RuPAC2016.org][RuPAC’16]]      | *?*    |
| IPAC       | <2017-05-14>--<2017-05-19> | Copenhagen, Denmark                        | 2017 | [[file:IPAC2017.org][IPAC’17]]       | *?*    |
| ERL        | <2017-06-18>--<2017-06-23> | Geneva, Switzerland                        | 2017 | [[file:ERL2017.org][ERL’17]]        | *?*    |
| SRF        | <2017-07-17>--<2017-07-21> | Lanzhou, China                             | 2017 | [[file:SRF2017.org][SRF’17]]        | *?*    |
| FEL        | <2017-08-20>--<2017-08-25> | Santa Fe, NM, USA                          | 2017 | [[file:FEL2017.org][FEL’17]]        | *?*    |
| IBIC       | <2017-08-20>--<2017-08-24> | Grand Rapids, MI, USA                      | 2017 | [[file:IBIC2017.org][IBIC’17]]       | *?*    |
| SAP        | <2017-08-28>--<2017-08-30> | Jishou, Hunan, China                       | 2017 | [[file:SAP2017.org][SAP’17]]        | *?*    |
| COOL       | <2017-09-18>--<2017-09-21> | Bonn, Germany                              | 2017 | [[file:COOL2017.org][COOL’17]]       | *?*    |
| ICALEPCS   | <2017-10-08>--<2017-10-13> | Barcelona, Spain                           | 2017 | [[file:ICALEPCS2017.org][ICALEPCS’17]]   | *?*    |
| FLS        | <2018-03-05>--<2018-03-09> | Shanghai, China                            | 2018 | [[file:FLS2018.org][FLS’18]]        | *?*    |
| IPAC       | <2018-04-29>--<2018-05-04> | Vancouver, Canada                          | 2018 | [[file:IPAC2018.org][IPAC’18]]       | *?*    |
| HB         | <2018-06-18>--<2018-06-22> | Daejeon, Korea                             | 2018 | [[file:HB2018.org][HB’18]]         | *?*    |
| MEDSI      | <2018-06-25>--<2018-06-29> | Paris, France                              | 2018 | [[file:MEDSI2018.org][MEDSI’18]]      | *?*    |
| IBIC       | <2018-09-09>--<2018-09-13> | Shanghai, China                            | 2018 | [[file:IBIC2018.org][IBIC’18]]       | *?*    |
| ECRIS      | <2018-09-10>--<2018-09-14> | Catania, Italy                             | 2018 | [[file:ECRIS2018.org][ECRIS’18]]      | *?*    |
| LINAC      | <2018-09-16>--<2018-09-21> | Beijing, China                             | 2018 | [[file:LINAC2018.org][LINAC’18]]      | *?*    |
| eeFACT     | <2018-09-24>--<2018-09-27> | Hong Kong, China                           | 2018 | [[file:eeFACT2018.org][eeFACT’18]]     | *?*    |
| RuPAC      | <2018-10-01>--<2018-10-05> | Protvino, Russia                           | 2018 | [[file:RuPAC2018.org][RuPAC’18]]      | *?*    |
| PCaPAC     | <2018-10-16>--<2018-10-19> | Hsinchu, Taiwan                            | 2018 | [[file:PCaPAC2018.org][PCaPAC’18]]     | *?*    |
| ICAP       | <2018-10-20>--<2018-10-24> | Key West, FL, USA                          | 2018 | [[file:ICAP2018.org][ICAP’18]]       | *?*    |
| HIAT       | <2018-10-22>--<2018-10-26> | Lanzhou, China                             | 2018 | [[file:HIAT2018.org][HIAT’18]]       | *?*    |
| IPAC       | <2019-05-19>--<2019-05-24> | Melbourne, Australia                       | 2019 | [[file:IPAC2019.org][IPAC’19]]       | *?*    |
| SRF        | <2019-06-30>--<2019-07-05> | Dresden, Germany                           | 2019 | [[file:SRF2019.org][SRF’19]]        | *?*    |
| FEL        | <2019-08-26>--<2019-08-30> | Hamburg, Germany                           | 2019 | [[file:FEL2019.org][FEL’19]]        | *?*    |
| NAPAC      | <2019-09-02>--<2019-09-06> | Lansing, MI, USA                           | 2019 | [[file:NAPAC2019.org][NAPAC’19]]      | *?*    |
| IBIC       | <2019-09-08>--<2019-09-12> | Malmö, Sweden                              | 2019 | [[file:IBIC2019.org][IBIC’19]]       | *?*    |
| ERL        | <2019-09-15>--<2019-09-20> | Berlin, Germany                            | 2019 | [[file:ERL2019.org][ERL’19]]        | *?*    |
| CYCLOTRONS | <2019-09-22>--<2019-09-27> | Cape Town, South Africa                    | 2019 | [[file:CYCLOTRONS2019.org][CYCLOTRONS’19]] | *?*    |
| COOL       | <2019-09-23>--<2019-09-27> | Novosibirsk, Russian                       | 2019 | [[file:COOL2019.org][COOL’19]]       | *?*    |
| ICALEPCS   | <2019-10-07>--<2019-10-11> | Brooklyn, New York City, NY, USA           | 2019 | [[file:ICALEPCS2019.org][ICALEPCS’19]]   | *?*    |
| IPAC       | <2020-05-10>--<2020-05-15> | Caen, France                               | 2020 | [[file:IPAC2020.org][IPAC’20]]       | *?*    |
| LINAC      | <2020-09-01>--<2020-09-04> | Liverpool, UK                              | 2020 | [[file:LINAC2020.org][LINAC’20]]      | *?*    |
| IBIC       | <2020-09-14>--<2020-09-18> | Santos, Brazil                             | 2020 | [[file:IBIC2020.org][IBIC’20]]       | *?*    |
| ECRIS      | <2020-09-28>--<2020-09-30> | East Lansing, MI, USA                      | 2020 | [[file:ECRIS2020.org][ECRIS’20]]      | *?*    |
| IPAC       | <2021-05-24>--<2021-05-28> | Campinas, Brazil                           | 2021 | [[file:IPAC2021.org][IPAC’21]]       | *?*    |
| SRF        | <2021-06-27>--<2021-07-02> | East Lansing, MI, USA                      | 2021 | [[file:SRF2021.org][SRF’21]]        | *?*    |
| MEDSI      | <2021-07-26>--<2021-07-29> | Chicago, IL, USA                           | 2021 | [[file:MEDSI2021.org][MEDSI’21]]      | *?*    |
| IBIC       | <2021-09-13>--<2021-09-17> | Pohang, Korea                              | 2021 | [[file:IBIC2021.org][IBIC’21]]       | *?*    |
| RuPAC      | <2021-09-27>--<2021-10-01> | Alushta, Russia                            | 2021 | [[file:RuPAC2021.org][RuPAC’21]]      | *?*    |
| HB         | <2021-10-04>--<2021-10-08> | Batavia, IL, USA                           | 2021 | [[file:HB2021.org][HB’21]]         | *?*    |
| ICALEPCS   | <2021-10-14>--<2021-10-22> | Shanghai, China                            | 2021 | [[file:ICALEPCS2021.org][ICALEPCS’21]]   | *?*    |
| COOL       | <2021-11-01>--<2021-11-05> | Novosibirsk, Russian                       | 2021 | [[file:COOL2021.org][COOL’21]]       | *?*    |
| IPAC       | <2022-06-12>--<2022-06-17> | Bangkok, Thailand                          | 2022 | [[file:IPAC2022.org][IPAC’22]]       | *?*    |
| HIAT       | <2022-06-27>--<2022-07-01> | Darmstadt, Germany                         | 2022 | [[file:HIAT2022.org][HIAT’22]]       | *?*    |
| NAPAC      | <2022-08-07>--<2022-08-12> | Albuquerque, NM, USA                       | 2022 | [[file:NAPAC2022.org][NAPAC’22]]      | *?*    |
| FEL        | <2022-08-22>--<2022-08-26> | Trieste, Italy                             | 2022 | [[file:FEL2022.org][FEL’22]]        | *?*    |
| LINAC      | <2022-08-28>--<2022-09-02> | Liverpool, UK                              | 2022 | [[file:LINAC2022.org][LINAC’22]]      | *?*    |
| IBIC       | <2022-09-11>--<2022-09-15> | Kraków, Poland                             | 2022 | [[file:IBIC2022.org][IBIC’22]]       | *?*    |
| eeFACT     | <2022-09-12>--<2022-09-16> | Frascati, Italy                            | 2022 | [[file:eeFACT2022.org][eeFACT’22]]     | *?*    |
| PCaPAC     | <2022-10-04>--<2022-10-07> | Dolní Brežany, Czech Republic              | 2022 | [[file:PCaPAC2022.org][PCaPAC’22]]     | *?*    |
| CYCLOTRONS | <2022-12-05>--<2022-12-09> | Beijing, China                             | 2022 | [[file:CYCLOTRONS2022.org][CYCLOTRONS’22]] | *?*    |
| IPAC       | <2023-05-07>--<2023-05-12> | Venice, Italy                              | 2023 | [[file:IPAC2023.org][IPAC’23]]       | *?*    |
| SRF        | <2023-06-25>--<2023-06-30> | Grand Rapids, MI, USA                      | 2023 | [[file:SRF2023.org][SRF’23]]        | *?*    |
| FLS        | <2023-08-27>--<2023-09-01> | Luzern, Switzerland                        | 2023 | [[file:FLS2023.org][FLS’23]]        | *?*    |
| IBIC       | <2023-09-10>--<2023-09-14> | Saskatoon, Canada                          | 2023 | [[file:IBIC2023.org][IBIC’23]]       | *?*    |
| ICALEPCS   | <2023-10-07>--<2023-10-13> | Cape Town, South Africa                    | 2023 | [[file:ICALEPCS2023.org][ICALEPCS’23]]   | *?*    |
| COOL       | <2023-10-08>--<2023-10-14> | Montreux, Switzerland                      | 2023 | [[file:COOL2023.org][COOL’23]]       | *?*    |
| HB         | <2023-10-09>--<2023-10-13> | CERN, Geneva, Switzerland                  | 2023 | [[file:HB2023.org][HB’23]]         | *?*    |
| MEDSI      | <2023-11-06>--<2023-11-10> | Beijing, China                             | 2023 | [[file:MEDSI2023.org][MEDSI’23]]      | *?*    |
| IPAC       | <2024-05-18>--<2024-05-24> | Nashville, TN, USA                         | 2024 | [[file:IPAC2024.org][IPAC’24]]       | *?*    |
| FEL        | <2024-08-19>--<2024-08-23> | Warsaw, Poland                             | 2024 | [[file:FEL2024.org][FEL’24]]        | *?*    |
| LINAC      | <2024-08-25>--<2024-08-30> | Chicago, IL, USA                           | 2024 | [[file:LINAC2024.org][LINAC’24]]      | *?*    |
| IBIC       | <2024-09-09>--<2024-09-13> | Beijing, China                             | 2024 | [[file:IBIC2024.org][IBIC’24]]       | *?*    |
| ECRIS      | <2024-09-15>--<2024-09-19> | Darmstadt, Germany                         | 2024 | [[file:ECRIS2024.org][ECRIS’24]]      | *?*    |
| ERL        | <2024-09-24>--<2024-09-27> | Tsukuba, Japan                             | 2024 | [[file:ERL2024.org][ERL’24]]        | *?*    |
| eeFACT     | <2025-03-03>--<2025-03-07> | Tsukuba, Japan                             | 2025 | [[file:eeFACT2025.org][eeFACT’25]]     | *?*    |
| IPAC       | <2025-06-01>--<2025-06-06> | Taipei, Taiwan                             | 2025 | [[file:IPAC2025.org][IPAC’25]]       | *?*    |
| HIAT       | <2025-06-22>--<2025-06-27> | East Lansing, MI, USA                      | 2025 | [[file:HIAT2025.org][HIAT’25]]       | *?*    |
| IBIC       | <2025-09-07>--<2025-09-11> | Liverpool, UK                              | 2025 | [[file:IBIC2025.org][IBIC’25]]       | *?*    |
| MEDSI      | <2025-09-15>--<2025-09-19> | Lund, Sweden                               | 2025 | [[file:MEDSI2025.org][MEDSI’25]]      | *?*    |
| ICALEPCS   | <2025-09-20>--<2025-09-26> | Chicago, IL, USA                           | 2025 | [[file:ICALEPCS2025.org][ICALEPCS’25]]   | *?*    |
| SRF        | <2025-09-21>--<2025-09-26> | Tokyo, japan                               | 2025 | [[file:SRF2025.org][SRF’25]]        | *?*    |
| HB         | <2025-10-19>--<2025-10-24> | Huizhou, Guangdong, China                  | 2025 | [[file:HB2025.org][HB’25]]         | *?*    |
#+TBLFM: $4='(if (string-match "[[<]\\([0-9]\\{4\\}\\)-[0-9]\\{2\\}-[0-9]\\{2\\} ?[^]\n>]*?[]>]\\(--?-?[[<][0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\} ?[^]\n>]*?[]>]\\)?" $2) (match-string 1 $2) "")
#+TBLFM: $5='(concat "[" "[file:" $1 $4 ".org][" $1 "’" (substring $4 2 4) "]" "]")
#+TBLFM: $6='(if (file-exists-p (concat $1 $4 ".org")) "" "*?*")





